; domain
(define (domain gripper-strips)
 (:requirements :strips :typing :constraints) 
 (:types type_1 object type_2 type_3)
 (:predicates (pred_1 ?v6 - type_2 ?v5 - type_1)
 	      (pred_2 ?v7 - object ?v5 - type_1)
	      (pred_4 ?v6 - type_2 ?v4 - type_3)
	      (pred_3 ?v6 - type_2 ?v7 - object ?v4 - type_3))

   (:action op_3
       :parameters  (?v6 - type_2 ?v2 ?v3 - type_1)
       :precondition (and  (pred_1 ?v6 ?v2))
       :effect (and  (pred_1 ?v6 ?v3)
		     (not (pred_1 ?v6 ?v2))))

   (:action op_2
       :parameters (?v6 - type_2 ?v1 - object ?v8 - type_1 ?v4 - type_3)
       :precondition  (and  (pred_2 ?v1 ?v8) (pred_1 ?v6 ?v8) (pred_4 ?v6 ?v4))
       :effect (and (pred_3 ?v6 ?v1 ?v4)
		    (not (pred_2 ?v1 ?v8)) 
		    (not (pred_4 ?v6 ?v4))))

   (:action op_1
       :parameters (?v6 - type_2 ?v1 - object ?v8 - type_1 ?v4 - type_3)
       :precondition  (and  (pred_3 ?v6 ?v1 ?v4) (pred_1 ?v6 ?v8))
       :effect (and (pred_2 ?v1 ?v8)
		    (pred_4 ?v6 ?v4)
		    (not (pred_3 ?v6 ?v1 ?v4)))))

; problem
(define (problem gripper-2-3-3)
(:domain gripper-strips)
(:objects obj_03 obj_09 - type_2
obj_07 obj_01 obj_11 obj_10 - type_3
obj_06 obj_04 obj_12 - type_1
obj_05 obj_08 obj_02 - object)
(:init
(pred_1 obj_03 obj_04)
(pred_4 obj_03 obj_07)
(pred_4 obj_03 obj_01)
(pred_1 obj_09 obj_06)
(pred_4 obj_09 obj_11)
(pred_4 obj_09 obj_10)
(pred_2 obj_05 obj_06)
(pred_2 obj_08 obj_12)
(pred_2 obj_02 obj_06)
)
(:goal
(and
(pred_2 obj_05 obj_04)
(pred_2 obj_08 obj_12)
(pred_2 obj_02 obj_06)
)
)

(:constraints
  (and
    (always (not (and (pred_1 obj_03 obj_04) (pred_1 obj_09 obj_04))))
  )
)
)

; plan
1. (op_2 obj_09 obj_05 obj_06 obj_10)
   deleted: (pred_2 obj_05 obj_06) (pred_4 obj_09 obj_10)
   added: (pred_3 obj_09 obj_05 obj_10)
   goals met: 2 of 3
2. (op_3 obj_03 obj_04 obj_06)
   deleted: (pred_1 obj_03 obj_04)
   added: (pred_1 obj_03 obj_06)
   goals met: 2 of 3
3. (op_3 obj_09 obj_06 obj_04)
   deleted: (pred_1 obj_09 obj_06)
   added: (pred_1 obj_09 obj_04)
   goals met: 2 of 3
4. (op_1 obj_09 obj_05 obj_04 obj_10)
   deleted: (pred_3 obj_09 obj_05 obj_10)
   added: (pred_2 obj_05 obj_04) (pred_4 obj_09 obj_10)
   goals met: 3 of 3
